let teachers = {
    choose: ["Оберіть Викладача"],
    ik: ["Андрущак В.С.","Артеменко", "Бак Р.І.", "Белей О.І.", "Бешлей М.І.", "Бродяк О.Я.","Бугиль Б.А.","Веселовська О.В.","Головатий А.І.","Демидов І.В.","Дмитрів Х.П.","Добош О.С.","Думич С.С.","Завущак І.І.","Кагало І.О.","Коваль Б.В.","Коломієць О.В.","Конюхов С.В.","Кориневський М.А.","Костів О.Л.","Кузьмин Р.Я.","Максимюк Т.А.","Павликевич М.Й.","Панчак Р.Т.","Пастирська І.Я.","Петрович І.В.","Пиріг Ю.В.","Плесканка Н.М.","Повторева С.М.","Пришляк М.В.","Стебельська О.І.","Юринець Р.В.","Яремко О.М."],
    an: ["Балацька Л.П.","Буковський І.В.","Вус Б.С.", "Гадьо І.В.","Гоблик В.В.", "Голяка Р.Л.","Здеб В.Б.", "Карп Ю.С.","Кіселичник М.Д.", "Когут З.О.","Колодій Н.В.", "Кузьмин Р.Я.","Лаба Г.П.", "Лазько", "Лебідь С.Ю.","Міськів В.В.", "Николишин М.Й.","Процик В.І.", "Сенів Л.А.","Симотюк М.М.", "Скалецький М.П.","Сологуб Б.В.", "Стебельська О.І.","Товстюк К.К.", "Токарєва М.О.","Харчишин Б.М.", "Чумакевич В.О." ],
    bi: ["Венгрин Б.Я.","Вус Б.С.", "Гавриляк В.В.", "Гетьманчук М.П.","Гліненко Л.К.", "Гоблик В.В.","Голяка Р.Л.", "Данилов А.Б.","Залуцька Г.І.", "Івасик Г.В.","Карп Ю.С.", "Кіселичник М.Д.","Комаренська З.М.", "Лаба Г.П.","Лазько", "Лебідь С.Ю.","Ліске О.М.", "Лозинський В.І.","Невінський Д.В.", "Петрович Й.М.","Середницька А.Я.", "Смердова Т.А.","Старчевський В.Л.", "Сторчун Є.В.","Фаст В.М.", "Хар О.Ю.","Чабан А.В.", "Яковенко Є.І."],
    el: ["Балабан О.В.","Барило Г.І.","Беспалов А.Л.", "Булик-Верхола С.З.","Венгрин Б.Я.", "Гельжинський І.І.","Гущак Р.І.", "Івах М.С.","Ільканич К.І.", "Когут З.О.","Коляса Л.І.", "Комаренська З.М.","Кремер І.П.", "Кучмій Г.Л.","Лукіянець Б.А.", "Максимів І.П.","Матулка Д.В.", "Микитюк З.М.","Повторева С.М.", "Рибицька О.М.","Романів", "Сеник А.П.", "Старчевський В.Л.","Стахіра П.Й.", "Стебельська О.І.","Строган О.І.", "Сушинський О.Є.","Фучила О.М.", "Яцишин Б.П."],
    mn: ["Балабан О.В.","Булавінець Т.О.", "Венгрин Б.Я.","Вороняк Т.І.", "Гніліцький Я.М.","Губа С.К.", "Демкович І.В.","Дружинін А.О.", "Єрохов В.Ю.","Когут З.О.", "Колесник Г.О.","Коляса Л.І.", "Комаренська З.М.","Крайник Л.Б.", "Логуш О.І.","Лукіянець Б.А.", "Лях-Кагуй Н.С.","Малик О.П.", "Матулка Д.В.","Муравський Л.І.", "Нічкало С.І.","Петровська Г.А.", "Повторева С.М.","Пура Я.С.", "Рибицька О.М.","Сеник А.П.", "Сиротюк С.В.", "Старчевський В.Л.", "Стебельська О.І.","Убізський С.Б.", "Фітьо В.М.","Ховерко Ю.М.", "Шкілюк О.П.","Яремчук І.Я."],
    tr: ["Андрусяк І.В.","Балабан О.В.", "Балацька Л.П.","Бешлей М.І.", "Бурачок Р.А.","Вільховченко Н.П.", "Гадьо І.В.","Гетьманчук М.П.", "Гнатчук М.М.","Голяка Р.Л.", "Городиловська Г.П.","Данилов А.Б.", "Демидов І.В.","Децик К.О.", "Залуцька Г.І.","Здеб В.Б.", "Змисний М.М.","Карп Ю.С", "Клапчук М.І.","Климаш М.М.", "Колодій Р.С.","Красько О.В.", "Кузик А.О.","Кулик І.В.", "Курапов П.Р.","Лаба Г.П.", "Лазько","Ліске О.М.","Маньковський С.В.", "Матвійків М.Д.","Матієшин Ю.М.", "Матулка Д.В.","Мінзюк В.В.", "Оборжицький В.І.","Пабирівський В.В.", "Пастирська І.Я.","Пиріг Ю.В.", "Понеділок Г.В.","Протасевич В.Г.", "Прудиус І.Н.","Ратич А.Т.", "Романишин Ю.М.","Селюченко М.О.", "Середницька А.Я.","Сніцарук Л.А.", "Сторож В.Г.","Фабіровський С.Є.", "Хар О.Ю.","Цимбрило С.М.", "Чайковський І.Б.","Чернихівський Є.М.", "Шаповалов Ю.І.","Юзефович Р.М.", "Якубенко В.М."]
};

let specialty = document.getElementById("specialty");
let teacher = document.querySelector("#teacher");
window.onload = selectSpecialty;
specialty.onchange = selectSpecialty;

function selectSpecialty(ev){
  teacher.innerHTML = "";
  let c = this.value || "choose", o;
  for(let i = 0; i < teachers[c].length; i++){
    o = new Option(teachers[c][i],i,false,false);
    teacher.add(o);
  };
}